
const cookingData = 
{
    cooking: 
    [
        {
            name: 'தலபாக்கட்டு சிக்கன் பிரியாணி செய்முறை (Cooking instructions)',
            slug: 'thalapakattu-briyani',
            category: 'Cooking',
            image: '/images/paneer_butter_masala.jpg',
            description: 'தலபாக்கட்டு சிக்கன் பிரியாணி செய்முறை (Cooking instructions)',
            groups: 
            [
                {
                    title: 'அரிசி, கோழியை சுத்தம் செய்யவும்',
                    steps: 
                    [   
                        {   step: '1',
                            instruction: 'கோழியை நன்கு கழுவி சுத்தம் செய்யவும்.',
                        },
                        {   step: '2',
                            instruction: 'சீரக சம்பா அரிசியைக் கழுவி குறைந்தபட்சம் 30 நிமிடம் தண்ணீரில் ஊற வைக்கவும்.',
                        },
                    ],
                },
                {
                    title: 'பிரியாணி மசாலா - தயார் செய்யவும்',
                    steps: 
                    [   
                        {   step: '1',
                            instruction: 'ஒரு மிக்சி ஜாரில், பிரியாணி மசாலா Pack பொருட்களை கலவையை ஒன்றாக சேர்த்து கரடுமுரடாக பொடிக்கவும். ஒதுக்கி வைக்கவும்.',
                        },
                    ],
                },
                {
                    title: 'வெங்காயம், இஞ்சி, பூண்டு விழுது - தயார் செய்யவும்.',
                    steps: 
                    [   
                        {   step: '1',
                            instruction: 'ஒரு மிக்சி ஜாரில், வெங்காயம், பச்சை மிளகாய், இஞ்சி, பூண்டு விழுது, கொத்தமல்லி இலைகள் மற்றும் புதினா இலைகளை அரைக்கவும்.',
                        },
                    ],
                },
                {
                    title: 'சமைக்கவும்',
                    steps: 
                    [   
                        {   step: '1',
                            instruction: 'மிதமான தீயில் பிரஷர் குக்கரில் எண்ணெயை சூடாக்கி, அதில் வெங்காயம், இஞ்சி பூண்டு விழுது சேர்த்து ஒரு நிமிடம் வதக்கவும்.',
                        },
                        {   step: '2',
                            instruction: 'இப்போது உப்பு, மஞ்சள் தூள், மிளகாய் தூள் மற்றும் கரம் மசாலா சேர்க்கவும். எல்லாவற்றையும் நன்றாக கலக்கவும்.',
                        },
                        {   step: '3',
                            instruction: 'தயிர் சேர்த்து, நன்றாக கலக்கவும்.',
                        },
                        {   step: '4',
                            instruction: 'அரைத்த பிரியாணி மசாலாவை சேர்த்து நன்கு கலக்கவும்.',
                        },
                        {   step: '5',
                            instruction: 'கோழி சேர்த்து கலக்கவும், நன்கு வதக்கவும்.',
                        },
                        {   step: '6',
                            instruction: 'ஒரு மூடியால் மூடி, மிதமான தீயில் 15 நிமிடங்களுக்கு சமைக்கவும். தண்ணீர் எதுவும் சேர்க்க வேண்டாம். 5 நிமிடங்களுக்கு ஒரு முறை வதக்கவும்.',
                        },
                        {   step: '7',
                            instruction: '15 நிமிடங்களுக்கு பிறகு, சமைத்த கோழியை , மற்றொரு சமையல் பாத்திரத்தில் மாற்றவும்.',
                        },
                        {   step: '8',
                            instruction: 'பாத்திரத்தில் எவ்வளவு தண்ணீர் மீதமுள்ளது என்பதை அளவிடவும். அரிசியின் அளவுக்கு 2 மடங்கு தண்ணீர் சேர்க்க வேண்டும்.',
                        },
                        {   step: '9',
                            instruction: 'எலுமிச்சை சாறு, நறுக்கிய கொத்தமல்லி இலைகள் மற்றும் புதினா இலைகளை சேர்க்கவும். கலவையை கொதிக்க விடவும்.',
                        },
                        {   step: '10',
                            instruction: 'கோழியை மீண்டும் சேர்த்து மீண்டும் கொதிக்க விடவும். மசாலாவை சரிபார்க்கவும். தேவைப்பட்டால் மேலும் உப்பு சேர்க்கவும்.',
                        },
                        {   step: '11',
                            instruction: 'ஊறவைத்த அரிசியைக் காயவைத்து, கடாயில் சேர்க்கவும். கொதிக்கும் வரை காத்திருங்கள்.',
                        },
                        {   step: '12',
                            instruction: 'கடாயை ஒரு மூடியால் மூடி, மிதமான தீயில் முதல் 5 நிமிடங்கள் சமைக்கவும்.',
                        },
                        {   step: '13',
                            instruction: 'மூடியைத் திறக்கவும். கீழே இருந்து ஒரு முறை மெதுவாக கலந்து, மீண்டும் மூடியை மூடி, மிகக் குறைந்த தீயில் 10 நிமிடங்கள் சமைக்கவும். மூடி மேலே எடையை வைத்திருங்கள்.',
                        },
                        {   step: '14',
                            instruction: 'அதன் பிறகு, மூடியைத் திறந்து அரிசி வெந்துவிட்டதா என்று பார்க்கவும். தேவைப்பட்டால் மேலும் இரண்டு நிமிடங்கள் சமைக்கவும். சுடரை அணைத்து, ஒரு மூடியுடன் கடாயை மூடவும். அடுத்த 20 நிமிடங்களுக்கு அதை திறக்கவேண்டாம். இந்த நேரம் மிகவும் முக்கியமானது.',
                        },
                        {   step: '15',
                            instruction: 'இப்போது நீங்கள் உணவைத் திறந்து சாப்பிடலாம்',
                        },

                    ],
                },

            ]    
        },
    ],
};

export default cookingData;